tutorials/11UnsteadyBBOpen/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "2000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
22000
(
(1.83301e-07 -1.7403e-07 0)
(6.85716e-07 7.61098e-08 0)
(8.13445e-07 1.00594e-07 0)
(1.0655e-06 8.31466e-08 0)
(1.39466e-06 8.78881e-08 0)
(1.84018e-06 9.96994e-08 0)
(2.46573e-06 7.59307e-08 0)
(3.23666e-06 4.76109e-08 0)
...
)
;

boundaryField
{
    Adiabatic_walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Right
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Inlet
    {
        type            fixedValue;
        value           uniform (0.0157 0 0);
    }
    Outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
