tutorials/11UnsteadyBBOpen/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Adiabatic_walls
    {
        type            calculated;
        value           $internalField;
    }


    Left
    {
        type            calculated;
        value           $internalField;
    }
    Right
    {
        type            calculated;
        value           $internalField;
    }

    Inlet
    {
        type            calculated;
        value           $internalField;
    }
    Outlet
    {
        type            calculated;
        value           $internalField;
    }


    frontAndBack
    {
        type empty;
    }
}

// ************************************************************************* //
